import { DataItem } from "./components/MainLayout";

const initData: DataItem[] = [
  { info: "Политика", active: false, from: 2000, to: 2005, slides: [
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
  ], },
  { info: "Еда", active: false, from: 2006, to: 2008, slides: [
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
  ], },
  { info: "Спорт", active: false, from: 2009, to: 2010,slides: [
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
  ], },
  { info: "Литература", active: false, from: 2011, to: 2013,
  slides: [
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
  ], },
  { info: "Кино", active: false, from: 2013, to: 2014,
  slides: [
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
  ], },
  {
    info: "Наука",
    active: false,
    from: 2015,
    to: 2022,
    slides: [
      {
        header: 2015,
        p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        header: 2015,
        p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        header: 2015,
        p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        header: 2015,
        p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
    ],
  },
]

export default initData