// Для превью

import { DataItem } from "./components/MainLayout";

const initData: DataItem[] = [
  { info: "Политика", active: false, from: 1990, to: 1995, slides: [
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
  ], },
  { info: "Еда", active: false, from: 1996, to: 2001, slides: [
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
  ], },
  { info: "Спорт", active: false, from: 2002, to: 2007, slides: [
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
  ], },
  { info: "Литература", active: false, from: 2008, to: 2013, slides: [
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
  ], },
  { info: "Кино", active: false, from: 2014, to: 2019, slides: [
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      header: 2015,
      p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
  ], },
  {
    info: "Наука",
    active: false,
    from: 2020,
    to: 2023,
    slides: [
      {
        header: 2015,
        p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        header: 2015,
        p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        header: 2015,
        p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        header: 2015,
        p: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
    ],
  },
]

export default initData